<template>
  <div class="sTournamentOverview--rules">
    <div class="wrap-body">
      <div class="sTournamentOverview__info">
        <svg-icon name="info.svg" />
        Для участия подтвердите свою заявку в период 28 января 2024 г. в 14:00 - 28 февраля 2024 в
        14:00
      </div>
      <div class="sTournamentOverview__title-item">
        <h4>1. Общая информация о проведении Соревнования</h4>
        <ul>
          <li><span> 1.1 </span>Соревнования проходят на турнирной платформе QYBER.RU;</li>
          <li><span> 1.2 </span>Минимальный возраст участников — 18 лет;</li>
          <li>
            <span> 1.3 </span>Участники Соревнования должны являться гражданами Российской
            Федерации;
          </li>
          <li>
            <span> 1.4 </span>Каждый игрок должен иметь веб-камеру, чтобы судьи могли в любой момент
            турнира убедиться, что играет реальный игрок, а не подсадной профи;
          </li>

          <li>
            <span> 1.4.1 </span>Общение участников с судьями и другими официальными лицами
            Соревнования происходит в сервисе Discord;
          </li>
          <li>
            <span>1.4.2</span> Не позднее, чем за 30 минут до начала Соревнования, участники должны
            присоединиться к Discord-серверу и указать название своей команды. Для этого необходимо:
            перейти по указанной ссылке в пункте 1.4., выбрать роль CS 2 в канале #выбери игру,
            нажать правой кнопкой мыши на свой ник, выбрать «Настр. профиль сервера», ввести
            название команды ([Название команды] Никнейм) и нажать «Сохранить». Игроки, которые
            будут отсутствовать на сервере, и с ними не смогут связаться оппоненты или судьи, будет
            присвоено техническое поражение;
          </li>
          <li>
            <span> 1.5 </span>Каждый матч играется строго по расписанию. Матчи, с которых ведется
            официальная трансляция, стартуют исключительно по команде судьи. Расписание на каждый
            раунд можно посмотреть после формирования сетки на турнирной платформе;
          </li>
          <li>
            <span> 1.6 </span>Максимально допустимое время задержки начала матча по вине участника —
            10 (десять) минут после старта текущего раунда;
          </li>
          <li>
            <span> 1.7 </span>После окончания матча участники должны сообщить судьям результат.
            Участники обязаны делать скриншоты своих побед, сохранять их до конца Соревнования и
            загружать их в свои матчи;
          </li>
          <li>
            <span> 1.8 </span>После окончания матча, участники должны подтвердить счет. Для этого
            необходимо нажать на кнопку «Результат», внести результат игры и прикрепить скриншоты;
          </li>
          <li>
            <span> 1.9 </span>Если судья в течение 5 (пяти) минут после загрузки скриншотов, не
            продвинул победившего участника по сетке, участник должен обратиться к судье и указать
            на свой матч.
          </li>
        </ul>
        <h4>2. Формат и система проведения основного и финального этапа</h4>
        <ul>
          <li>
            <span> 2.1</span> Дисциплина «Боевая арена» (вид программы — CS 2): Соревнование
            проходит по олимпийской системе с выбыванием. Олимпийская система с выбыванием –
            система, при которой участник соревнований, проигравший встречу, выбывает из дальнейшего
            участия в данных соревнованиях;
          </li>
          <li><span> 2.2</span> Формат матчей турнира: Bo1;</li>
          <li>
            <span> 2.3</span> Bo1 — формат проведения, при котором серия продолжается до одной
            победы. Счет может быть 1:0, 0:1;
          </li>
          <li>
            <span> 2.4</span> Минимальное гарантированное время перерыва между матчами — 10 минут;
          </li>
          <li>
            <span> 2.5</span> Игрок находящийся выше в матче (по сетке) создаёт лобби и приглашает
            соперника.
          </li>
        </ul>
        <h4>3. Составы и замены</h4>
        <ul>
          <li>
            <span>3.1</span> Дисциплина «Боевая арена» (вид программы — CS 2): Соревнование проходит
            по олимпийской системе с выбыванием. Олимпийская система с выбыванием – система, при
            которой участник соревнований, проигравший встречу, выбывает из дальнейшего участия в
            данных соревнованиях;
          </li>
          <li><span>3.1.1</span> На турнир не допускаются замены.</li>
        </ul>
        <h4>4. Технические правила</h4>
        <ul>
          <li><span> 4.1</span> Разрешить наблюдение – разрешить;</li>
          <li><span> 4.2</span> Наличие тренера — запретить;</li>
          <li><span> 4.3</span> Приостановка игры — без ограничений.</li>
        </ul>
        <h4>5. Паузы</h4>
        <ul>
          <li>
            <span>5.1</span> Участники вправе останавливать гейм (если это предусмотрено
            дисциплиной) только по указанным ниже причинам и должны незамедлительно сообщить
            соперникам причину паузы. К допустимым причинам относятся следующие:
          </li>
          <li class="small"><span>•</span> Непреднамеренный разрыв соединения;</li>
          <li class="small">
            <span>•</span> Неисправность оборудования или проблема с программным обеспечением
            (например, проблемы с питанием монитора, выход из строя периферийных устройств или сбой
            игры).
          </li>
          <li>
            <span>5.2</span> Остановка гейма по другой причине расценивается как нарушение принципов
            честной игры;
          </li>
          <li><span>5.3</span> Приостановка игры — без ограничений.</li>
        </ul>
      </div>
    </div>
    <div class="wrap-footer d-lg-none">
      <div class="template template--footer">
        <Paginator
          :rows="rowsPerPage[0]"
          :totalRecords="totalRecords"
          :rowsPerPageOptions="rowsPerPage"
          :pageLinkSize="4"
        >
          <template #start="slotProps">
            Показано от {{ slotProps.state.page * slotProps.state.rows + 1 }} до
            {{
              slotProps.state.first + slotProps.state.rows > totalRecords
                ? totalRecords
                : slotProps.state.first + slotProps.state.rows
            }}
            из {{ totalRecords }} данных
          </template>
        </Paginator>
      </div>
    </div>
  </div>
</template>

<script setup>
  import MenuBlock from './MenuBlock.vue';
  import { useGlobalStore } from '~/store/globalStore';

  const globalStore = useGlobalStore();

  const totalRecords = ref(10);
  const rowsPerPage = ref([5, 10, 50, 100]);
</script>
