<template>
  <section class="sSponsorsAdvantages">
    <div class="container">
      <h2 class="h1">Преимущества сотрудничества с нами</h2>
      <div class="sSponsorsAdvantages__wrap">
        <div class="sSponsorsAdvantages__card">
          <div class="sSponsorsAdvantages__img-wrap">
            <div class="img-wrap-center">
              <NuxtImg
                src="/img/sSponsorsAdvantages-img-1.jpg"
                class="object-fit-js"
                alt="sSponsorsAdvantages"
              />
            </div>
          </div>
          <div class="sSponsorsAdvantages__content">
            <svg-icon name="users-medical.svg" />
            <h4>Лёгкий вход в киберспорт благодаря нишевым дисциплинам и лояльному комьюнити</h4>
            <p>
              Задача организации, в особенности же постоянное информационно-пропагандистское
              обеспечение нашей деятельности позволяет оценить значение существенных финансовых и
              административных условий. Товарищи! сложившаяся структура организации требуют от нас
              анализа позиций, занимаемых участниками в отношении поставленных задач. Задача
              организации, в особенности же дальнейшее развитие различных форм деятельности требуют
              определения и уточнения соответствующий условий активизации.
            </p>
            <p>
              Задача организации, в особенности же постоянное информационно-пропагандистское
              обеспечение нашей деятельности позволяет оценить значение существенных финансовых и
              административных условий. Товарищи! сложившаяся структура организации требуют от нас
              анализа позиций, занимаемых участниками в отношении поставленных задач. Задача
              организации, в особенности же дальнейшее развитие различных форм деятельности требуют
              определения и уточнения соответствующий условий активизации.
            </p>
          </div>
        </div>
        <div class="sSponsorsAdvantages__card">
          <div class="sSponsorsAdvantages__img-wrap">
            <div class="img-wrap-center">
              <NuxtImg
                src="/img/sSponsorsAdvantages-img-1.jpg"
                class="object-fit-js"
                alt="sSponsorsAdvantages"
              />
            </div>
          </div>
          <div class="sSponsorsAdvantages__content">
            <svg-icon name="users-medical.svg" />
            <h4>Лёгкий вход в киберспорт благодаря нишевым дисциплинам и лояльному комьюнити</h4>
            <p>
              Задача организации, в особенности же постоянное информационно-пропагандистское
              обеспечение нашей деятельности позволяет оценить значение существенных финансовых и
              административных условий. Товарищи! сложившаяся структура организации требуют от нас
              анализа позиций, занимаемых участниками в отношении поставленных задач. Задача
              организации, в особенности же дальнейшее развитие различных форм деятельности требуют
              определения и уточнения соответствующий условий активизации.
            </p>
            <p>
              Задача организации, в особенности же постоянное информационно-пропагандистское
              обеспечение нашей деятельности позволяет оценить значение существенных финансовых и
              административных условий. Товарищи! сложившаяся структура организации требуют от нас
              анализа позиций, занимаемых участниками в отношении поставленных задач. Задача
              организации, в особенности же дальнейшее развитие различных форм деятельности требуют
              определения и уточнения соответствующий условий активизации.
            </p>
          </div>
        </div>
        <div class="sSponsorsAdvantages__card">
          <div class="sSponsorsAdvantages__img-wrap">
            <div class="img-wrap-center">
              <NuxtImg
                src="/img/sSponsorsAdvantages-img-1.jpg"
                class="object-fit-js"
                alt="sSponsorsAdvantages"
              />
            </div>
          </div>
          <div class="sSponsorsAdvantages__content">
            <svg-icon name="users-medical.svg" />
            <h4>Лёгкий вход в киберспорт благодаря нишевым дисциплинам и лояльному комьюнити</h4>
            <p>
              Задача организации, в особенности же постоянное информационно-пропагандистское
              обеспечение нашей деятельности позволяет оценить значение существенных финансовых и
              административных условий. Товарищи! сложившаяся структура организации требуют от нас
              анализа позиций, занимаемых участниками в отношении поставленных задач. Задача
              организации, в особенности же дальнейшее развитие различных форм деятельности требуют
              определения и уточнения соответствующий условий активизации.
            </p>
            <p>
              Задача организации, в особенности же постоянное информационно-пропагандистское
              обеспечение нашей деятельности позволяет оценить значение существенных финансовых и
              административных условий. Товарищи! сложившаяся структура организации требуют от нас
              анализа позиций, занимаемых участниками в отношении поставленных задач. Задача
              организации, в особенности же дальнейшее развитие различных форм деятельности требуют
              определения и уточнения соответствующий условий активизации.
            </p>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
